package com.xytsz.xytsz.global;


import com.xytsz.xytsz.R;
import com.xytsz.xytsz.net.NetUrl;

import org.ksoap2.SoapEnvelope;
import org.ksoap2.serialization.SoapObject;
import org.ksoap2.serialization.SoapSerializationEnvelope;
import org.ksoap2.transport.HttpTransportSE;

/**
 * Created by admin on 2017/1/11.
 *
 * 基础设施
 */
public class Data {
    /**
     * 当前处置状态
     */
    public static final String[] phaseIndaciton = {"审核", "下派", "处置", "验收", "验收通过", "审核未通过"};

    /*
    * 处置等级*/
    public static String[] grades = new String[]{"一般病害", "应急抢险", "违章施工", "日常养护", "社会举报", "网格上报"};
    public static String[] departments = new String[]{"监控室", "明亮队", "交通设施队", "设施维修队", "环境巡察队"};
    //处置类型
    public static String[] dealtype = new String[]{"道路设施", "桥梁设施"};


    //设施类型
    public static String[][] facilitytypes = new String[][]{
            {"步道", "沥青路面", "井盖", "道牙", "座椅", "护栏", "雨污水井篦子", "抢险", "树池牙", "自行车架", "石球", "石墩", "抹灰", "挡桩", "挡车器", "防撞桶", "交通信号灯", "倒计时屏", "信号灯杆", "信号灯控制箱", "交通检查井", "交通标志牌", "交通标志杆", "观景灯"},
            {"桥名牌", "限载牌", "栏杆", "端柱", "人行道", "车行道", "机非隔离带", "伸缩缝", "泄水孔", "扶梯", "上部结构变异", "下部结构变异", "桥体"}
    };
    //病害类型
    public static String[][][] problemtypes = new String[][][]{
            {//道路设施
                    {"沉陷", "拱起", "坑洞", "麻面", "粉碎", "松散", "缺砖", "塌陷", "检查周边损坏", "破损"},//步道
                    {"翻浆", "坑槽", "碎裂", "网裂", "车辙", "拥包", "脱皮", "麻坑", "井盖下沉-周边损坏", "塌陷", "裂缝"},
                    {"井盖损坏", "井圈损坏"},
                    {"道牙损坏", "道牙啃边", "缺失", "翘起", "塌陷"},
                    {"座椅损坏", "木板缺少", "凳脚损坏", "座椅断裂"},
                    {"护栏损坏", "护栏缺失", "护栏歪斜"},
                    {"井篦子损坏", "井篦截面削弱", "雨水篦子变形", "雨水篦子凹陷", "链接断开"},
                    {"路面塌陷", "管道堵塞", "井盖丢失", "其它"},
                    {"缺失", "破损", "翘起", "塌陷"},
                    {"破损", "缺失"},
                    {"破损", "移位", "缺失"},
                    {"破损", "移位", "缺失"},
                    {"井边抹灰", "水泥面抹灰", "墙面抹灰", "小矮墙抹灰", "变电箱底座抹灰", "水泥台阶抹灰", "灯杆底座抹灰", "移位"},
                    {"丢失", "破损"},
                    {"破损", "缺失"},
                    {"破损"},
                    {"灯具老化", "亮度不清晰", "松动", "指示错误", "不亮"},
                    {"老化", "缺失笔画", "串色或黑屏"},
                    {"粘贴小广告", "表面喷涂", "倾斜"},
                    {"箱体破损", "底座腐蚀", "箱体粘贴小广告", "喷涂"},
                    {"井盖损坏", "井圈损坏"},
                    {"粘贴小广告", "表面喷涂", "倾斜", "版面破损", "老化脱落", "倾斜或倾倒"},
                    {"粘贴小广告", "表面喷涂", "倾斜"},
                    {"光源损坏", "灯罩破损", "灯罩丢失", "灯门丢失", "灯杆表面粘贴小广告", "人为破坏", "私搭乱接", "私自从灯杆取电"}

            },
            {//桥梁设施
                    {"涂污", "破损", "撤换"},
                    {"涂污", "破损", "撤换"},
                    {"污秽", "破损", "缺失", "松动", "掉漆", "露筋", "锈蚀"},
                    {"污秽", "破损", "错位", "掉漆", "露筋", "锈蚀"},
                    {"沉陷", "拥包", "剥落", "坑槽", "啃边", "路框差", "裂缝", "松动或变形", "步道砖缺损", "检查井下沉-周边损坏"},
                    {"拥包", "翻浆", "坑槽", "碎裂", "车辙", "修补损坏", "麻坑", "检查井下沉-周边损坏", "塌陷", "裂缝"},
                    {"破损", "缺失", "露筋", "锈蚀"},
                    {"堵塞", "损坏", "变形", "松动", "翘曲", "碎边", "过窄", "橡胶损坏", "桥头跳车"},
                    {"堵塞", "损坏", "松动", "锈蚀", "渗水", "脱落"},
                    {"破损", "缺失", "锈蚀", "掉漆"},
                    {"变色", "砼剥落", "露筋", "锈蚀", "裂缝", "松动", "渗水", "异常振动"},
                    {"砼剥落", "露筋", "锈蚀", "裂缝", "松动", "塌陷", "倾斜", "渗水", "位移", "变形"},
                    {"麻面", "破损", "乱涂乱画", "裂缝", "配套照明损坏"},

            }
    };
    //设施名字
    public static String[][][] facilitynames = new String[][][]{
            {//道路设施
                    {"高粱红花岗岩砖", "高粱红花岗岩盲道砖", "五莲花花岗岩砖", "五莲花花岗岩盲道砖", "彩砖", "九格砖", "V形砖", "小馒头砖", "水磨石", "透水砖", "盲道砖", "盲条砖"},
                    {"其它"},
                    {"其它"},
                    {"水泥路牙", "高粱红花岗岩路牙", "五莲花花岗岩路牙", "水磨石路牙"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"水泥树池牙", "高粱红花岗岩树池牙"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"}
            },
            {

                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"},
                    {"其它"}
            }
    };
    //设施大小
    public static String[][][][] facilitysizes = new String[][][][]{
            {//道路设施
                    {//步道
                            {"200*400*60", "800*400*100", "200*300*30", "600*300*60", "400*200*40", "600*100*300", "300*200*30", "600*600*30", "800*400*100"},//高粱红花岩岗砖
                            {"600*300*60", "其它"},//高粱红花岗岩盲道砖
                            {"800*400*80", "600*300*60", "800*400*80", "800*400*80", "其它"},//五莲花花岗岩砖
                            {"600*300*60", "800*400*80", "其它"},//五莲花花岗岩盲道砖
                            {"250*250*60", "300*150*60", "300*300*40", "250*250*40", "250*250**50", "其它"},//彩砖
                            {"250*250*40", "其它"},//九格砖
                            {"500*500*100", "其它"},//V形砖
                            {"200*100*60", "其它"},//小馒头砖
                            {"800*120*300", "其它"},//水磨石
                            {"200*100*60", "	200*200*40", "400*200*40", "400*200*60", "250*250*40", "500*200*60", "480*240*80"},//透水砖
                            {"250*250*60", "其它"},//盲道砖
                            {"其它"}//盲条砖
                    },

                    {//沥青
                            {"其它"}
                    },
                    {//井盖
                            {"其它"}
                    },

                    {//道牙
                            {"500*100*250", "500*100*300", "500*250*80", "500*300*120", "500*100*200", "600*100*200", "500*120*300", "600*150*300", "750*150*300", "其它"},//水泥路牙
                            {"700*120*300", "600*100*300", "600*120*300", "600*150*300", "500*100*300", "1200*100*200", "800*300*120", "700*100*200", "600*100*120", "700*100*300", "500*120*300", "其它"},//高粱红花岗岩路牙
                            {"800*300*120", "700*120*300", "750*120*300", "其它"},//五莲花花岗岩路牙
                            {"800*120*300"}//水磨石路牙
                    },

                    {//座椅
                            {"其它"}
                    },
                    {//护栏
                            {"其它"}
                    },
                    {//雨污水井篦子
                            {"其它"}
                    },
                    {//抢险
                            {"其它"}
                    },

                    {//水泥树池牙
                            {"1500*100*100", "1200*100*100", "1200*100*120", "500*100*200", "600*100*100", "1200*100*200", "1200*100*150", "600*100*150", "1200*60*150", "1200*120*150", "1200*80*200", "600*100*200", "1350*100*100", "1450*120*150", "1000*100*200", "1400*100*200", "1000*100*100", "其它"},//水泥树池牙
                            {"600*300*60", "700*100*200", "500*120*300", "1200*100*100", "1200*100*60", "600*100*150", "500*120*200", "1200*60*150", "1450*100*100", "1200*120*300", "1000*120*200", "1200*100*150", "1400*100*200", "1200*120*150", "其它"},//高粱红花岗岩树池牙
                    },

                    {//自行车架
                            {"其它"}
                    },
                    {//石球
                            {"其它"}
                    },
                    {//石墩
                            {"其它"}
                    },
                    {//抹灰
                            {"其它"}
                    },
                    {//挡桩
                            {"其它"}
                    },
                    {//挡车器
                            {"其它"}
                    },
                    {//防撞桶
                            {"其它"}
                    },
                    {//交通信号灯
                            {"其它"}
                    },
                    {//倒计时屏
                            {"其它"}
                    },
                    {//信号灯杆
                            {"其它"}
                    },
                    {//信号灯控制箱
                            {"其它"}
                    },
                    {//交通检查井
                            {"其它"}
                    },
                    {//交通标志牌
                            {"其它"}
                    },
                    {//交通标志杆
                            {"其它"}
                    },
                    {//观景灯
                            {"其它"}
                    }
            },
            {
                    {
                            {"其它"}
                    },
                    {
                            {"其它"}
                    },
                    {
                            {"其它"}
                    },
                    {
                            {"其它"}
                    },
                    {
                            {"其它"}
                    },
                    {//交通信号灯
                            {"其它"}
                    },
                    {//倒计时屏
                            {"其它"}
                    },
                    {//信号灯杆
                            {"其它"}
                    },
                    {
                            {"其它"}
                    },
                    {
                            {"其它"}
                    },
                    {
                            {"其它"}
                    },
                    {
                            {"其它"}
                    },
                    {
                            {"其它"}
                    }
            }
    };
    //道路
    public static String[] roads = new String[]{
            "新西路", "园林路", "果园西路", "果园北街", "兴云路", "双燕街",
                    "果园中街", "水源路", "农机路", "西门外大街", "康居东路", "党校路", "城后街", "新北路",
                    "新南路", "西统路", "101绕城线", "果园南路", "白云街", "绿地小区内环路"
    };


    //病害名称
    public static String[] pbname = new String[]{"一类病害", "二类病害", "三类病害"};

    public static Integer[] FirstImageID = {R.mipmap.first_collapse, R.mipmap.first_hole, R.mipmap.first_muddy, R.mipmap.first_package, R.mipmap.first_streetlight_fall};
    public static Integer[] SecondImageID = {R.mipmap.second_arch, R.mipmap.second_bias, R.mipmap.second_breakdown, R.mipmap.second_lid_break, R.mipmap.second_lid_collapse, R.mipmap.second_sink};
    public static Integer[] ThridImageID = {R.mipmap.thrid_breakdown, R.mipmap.thrid_cover_break, R.mipmap.thrid_hole, R.mipmap.thrid_kerbstone_break, R.mipmap.thrid_lamp_break, R.mipmap.thrid_light_break, R.mipmap.thrid_rail_hiatus, R.mipmap.thrid_road_arch};
    public static String[] FirstDesc = {"沥青路面塌陷", "道路出现坑洞", "沥青路面翻浆", "沥青路面拥包", "路灯倒塌"};
    public static String[] SecondDesc = {"步道拱起", "灯杆倾斜", "护栏损坏", "井盖损坏", "井盖周边塌陷", "步道出现沉陷"};
    public static String[] ThridDesc = {"井篦子损坏", "灯罩破损", "井篦子凹陷", "道牙损坏", "灯杆损坏", "路灯损坏", "护栏缺失", "步道麻面"};


    public static String getJson(String method ,String soap_action)throws  Exception{
        SoapObject soapObject = new SoapObject(NetUrl.nameSpace,method);
        SoapSerializationEnvelope envelope = new SoapSerializationEnvelope(SoapEnvelope.VER12);
        envelope.dotNet= true;
        envelope.bodyOut = soapObject;

        HttpTransportSE httpTransportSE = new HttpTransportSE(NetUrl.SERVERURL);
        httpTransportSE.call(soap_action,envelope);

        SoapObject object = (SoapObject) envelope.bodyIn;

        return object.getProperty(0).toString();
    }





}
